Revit 2027 API
RebarConstraint.IsBindingHandleWithTarget Method
 Gets the relationship between two RebarConstrainedHandles.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBindingHandleWithTarget()
Public Function IsBindingHandleWithTarget As Boolean
public:
bool IsBindingHandleWithTarget()
member IsBindingHandleWithTarget : unit -> bool
Return Value
Boolean
 Returns false if only the constrained RebarConstrainedHandle follows the target. Returns true if the constrained RebarConstrainedHandle and the target bar handle are bound and move together.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- Constrained rebar isn't a Shape Driven Rebar element. -or- The TargetRebarConstraintType is 'HookBend' or 'BarBend'. -or- The TargetRebarConstraintType is 'OutOfPlaneExtent' and the rebar target layout is either 'Number with Spacing' or 'Custom Spacing with non-variable formula'.
Remarks
Throws exception for any type of constraint other than 'ToOtherRebar' or if the TargetRebarConstraintType of the constraint is 'HookBend' or 'BarBend'.
Will throw if the target Rebar has the 'Number with Spacing' layout rule and the TargetRebarConstraintType of the constraint is 'OutOfPlaneExtent'.
Will throw if the target Rebar has the 'CustomSpacing' layout and the formula wil not permit to have a draggable 'OutOfPlaneExtent'.
Throws exception if the constraint is for a handle of a Free Form Rebar.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace